{
  "name": "Nicolas Silva Nogueira",
  "photo": "https://avatars.githubusercontent.com/u/132695547?s=400&u=683edd9ad52c82697e44845092a06750e0ea8e05&v=4",
  "job": "Jovem Aprendiz na General Motors",
  "location": "São José dos Campos - SP",
  "phone": "(12) 98308-7644",
  "email": "nsn.nicolas@gmail.com",
  "skills": {
    "hardSkills": [
      {
        "name": "HTML",
        "logo": "https://raw.githubusercontent.com/nckz06/js-developer-portfolio/main/data/imgs/html.png"
      },
      {
        "name": "CSS",
        "logo": "https://raw.githubusercontent.com/nckz06/js-developer-portfolio/main/data/imgs/css.png"
      },
      {
        "name": "JavaScript",
        "logo": "https://raw.githubusercontent.com/nckz06/js-developer-portfolio/main/data/imgs/js.png"
      },
      {
        "name": "MySQL",
        "logo": "https://raw.githubusercontent.com/nckz06/js-developer-portfolio/main/data/imgs/mysql.png"
      },
      {
        "name": "Python",
        "logo": "https://raw.githubusercontent.com/nckz06/js-developer-portfolio/main/data/imgs/python.png"
      }
    ],
    "softSkills": [
      "Empatia",
      "Observação",
      "Flexibilidade",
      "Organização",
      "Trabalho em equipe",
      "Resolução de problemas técnicos"
    ]
  },
  "languages": [
    "Português BR",
    "Inglês (intermediário)"
  ],
  "courses": [
    {
      "name": "Curso Técnico de Desenvolvimento de Sistemas",
      "date": "Em andamento",
      "time": "1200 horas",
      "description": "Dentro do curso Técnico de Desenvolvimento de Sistemas, será lecionado sobre as seguintes matérias: Lógica de Programação e Algoritmos, Sistemas Operacionais, Levantamento de Requisitos, Arquitetura de Redes com IoT, Banco de Dados, Programação Front-End e Back-End, entre outros conteúdos.",
      "url": ""
    },  
    {
      "name": "Formação JavaScript Developer",
      "date": "janeiro de 2026",
      "time": "39 horas",
      "description": "Nesta formação, foi ensinado desde os fundamentos desta linguagem de programação até o seu papel essencial na Web atualmente. Apresentando os conceitos necessários para utilizar o JavaScript na Web, com ênfase no consumo de APIs, convenções e boas práticas.",
      "url": ""
    },
    {
      "name": "Formação CSS Web Developer",
      "date": "agosto de 2025",
      "time": "43 horas",
      "description": "Nesta formação, foi aprendido a estilizar e turbinar ainda mais páginas Web com Cascading Style Sheets (CSS). Demonstrando como organizar a folha de estilos, como trabalhar com animações e suas boas práticas para criar ou replicar qualquer layout rico e bem estilizada.",
      "url": "https://hermes.dio.me/certificates/YM38FKWR.pdf"
    },
    {
      "name": "Formação HTML Web Developer",
      "date": "junho de 2025",
      "time": "21 horas",
      "description": "Nesta formação, foi aprensentado o HTML, a base para criar páginas Web. Aprendendo na prática como estruturar a marcação da página e como funciona cada tag, além dos elementos semânticos e outras boas práticas na hora de construir a página Web.",
      "url": "https://hermes.dio.me/certificates/O1OBBCMY.pdf"
    }
  ],
  "portfolio": [
    {
      "name": "DevArt: Projeto de Alto Valor - Edição Pringles",
      "url": "https://nckz06.github.io/Pringles/",
      "description": "Para alcançar o resultado esperado, o design foi realizado com o apoio das ferramentas Figma e PhotoShop. Após a obtenção de um design agradável, o protótipo foi desenvolvido com as linguagens HTML, CSS e JavaScript. Como principal foco do projeto, o aprendizado sobre as bibliotecas GSAP e Split Type do Javascript para a criação de animações dinâmicas que acontecem durante o rolamento da página.",
      "github": true
    },
    {
      "name": "Clone do site da HBO Max com Animações",
      "url": "https://nckz06.github.io/hbomax/",
      "description": "Clone do HBO Max com HTML e CSS contendo algumas modificações. Projeto de desafio final para a Trilha de CSS da Digital Innovation One. Para acrescentar elementos diferentes ao site original, foram criados elementos animados com CSS para agregar à experiência do usuário.",
      "github": true
    },
    {
      "name": "Projeto DIO: Multiverso Homem-Aranha",
      "url": "https://nckz06.github.io/spider-man-multiverse/",
      "description": "O objetivo do projeto é demonstrar os principais efeitos de CSS e explorar o máximo de animações para construir um layout rico baseado no multiverso do homem-aranha. Para a construção do projeto foram utilizados linguagens como: HTML, CSS e JavaScript. Com foco em pseudo-elementos, pseudo-classes, carousel 3D, translate e rotate no CSS, entre outras funcionalidades para agregar à página.",
      "github": true
    }
  ],
  "professionalExperience": [
    {
      "name": "Jovem Aprendiz - General Motors",
      "startDate": "agosto de 2025",
      "endDate": "",
      "description": "Responsável pela criação e manutenção de aplicações com a utilização da ferramenta Power Apps; Criação e aprimoramento de dashboards para insights com o uso do Power BI; Além de trazer soluções e automatização para auxiliar outros colaboradores em suas funcionalidades."
    },
    {
      "name": "Jovem Aprendiz - Akaer Engenharia S.A.",
      "startDate": "julho de 2024",
      "endDate": "julho de 2025",
      "description": "Responsável pela manutenção, suporte e configuração da plataforma SoftExpert Suite (SE Suite), mantendo a funcionalidade das operações e proporcionando melhorias nos processos corporativos; Elaboração de queries em SQL para análise e visualização de dados, como forma de fornecer insights sobre alterações e históricos do sistema, sendo integradas ao SE Suite para uso prático por diferentes áreas da empresa; Mapeamento e construção de fluxogramas de processos utilizando ferramentas específicas, com o objetivo de facilitar a compreensão e o redesenho de processos."
    },
    {
      "name": "Auxiliar de Loja - Americanas S.A.",
      "startDate": "maio de 2024",
      "endDate":"julho de 2024",
      "description": "Operação de caixa e atendimento ao cliente; Estocagem e reabastecimento dos produtos tanto almoxarifado quanto dentro do próprio estabelecimento, além de fornecer auxílio na organização e distribuição de produtos no varejo."
    }
  ]
}